#include "DxLib.h"

class MapControler {
public:
    int map[3][10][10] = {{
    {9,8,8,8,8,8,8,8,8,7},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {2,1,1,1,1,1,1,1,1,6},
    {3,4,4,4,4,4,4,4,4,5},
    },{
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,1,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0},
    }};
    /*
    mapを格納する配列
    1層目：playerが動ける範囲指定
    2層目：そのマスでの特殊操作
    3層目：そのマスに描画する画像
    */

    MapControler() {

    }

    int Mappixel_X(int x) {
        return 390 + (x * 50);
    }
    int Mappixel_Y(int y) {
        return 110 + (y * 50);
    }
    //引数に与えた配列の座標を画面内座標に変換する関数

    void MapPracer() {
        for (int i = 0; i < 10; i++) {
            for (int j = 0; j < 10; j++) {
                if (map[0][i][j] != 0) {
                    DrawCircle(Mappixel_X(i), Mappixel_Y(j), 10, GetColor(255, 255, 255), TRUE);
                }
            }
        }
    }
    //mapを描画する関数
};
